# formulae
brew "bash"                                 # shell
brew "bat"                                  # `cat` alternative
brew "coreutils"                            # GNU core utilities
brew "difftastic"                           # diff analysis and presentation
brew "duf"                                  # disk usage/free utility; 'df' alternative
brew "eza"                                  # `ls` alternative
brew "fastfetch"                            # system information
brew "fzf"                                  # fuzzy-finder
brew "git"                                  # source control
brew "git-lfs"                              # git large file storage
brew "git-delta"                            # git pager
brew "gnupg"                                # Gnu PGP
brew "glslviewer"                           # GLSL viewer
brew "golang"                               # go
brew "imagemagick"                          # image manipulation (yazi dep)
brew "lazygit"                              # git TUI
brew "lima"                                 # linux virtual machines
brew "lolcat"                               # rainbow text
brew "luarocks"                             # lua package manager
brew "neovim"                               # text editor
brew "nnn"                                  # TUI file manager
brew "node"                                 # nodejs
brew "pandoc"                               # document converter
brew "pinentry-mac"                         # macOS integration for GPG
brew "poppler"                              # PDF tools (yazi dep)
brew "pyenv"                                # python version manager
brew "python"                               # latest python
brew "ripgrep"                              # fuzzy-finder
brew "rsync"                                # file transfer used in backup script
brew "rustup"                               # rust
brew "sevenzip"                             # 7zip (yazi dep)
brew "slides"                               # presentation tool
brew "starship"                             # shell prompt
brew "thefuck"                              # last console command correction
brew "tmux"                                 # terminal multiplexer
brew "trash"                                # move to trash cli https://hasseg.org/trash/
brew "typtea"                               # typing speed tester
brew "unbound"                              # DNS resolver
brew "yazi"                                 # terminal file manager
brew "zbar"                                 # QR code reader
brew "zig"                                  # zig
brew "zsh"                                  # z shell
brew "zola"                                 # static site generator
brew "zoxide"                               # `cd` alternative

# zsh
brew "zsh-autosuggestions"                  # zsh-autosuggestions
brew "zsh-syntax-highlighting"              # zsh-syntax-highlighting

# casks
cask "caffeine"                             # prevent computer sleep
cask "dbeaver-community"                    # database manager
cask "docker-desktop"                       # containerization framework
cask "font-fira-code-nerd-font"             # font
cask "font-fira-mono-nerd-font"             # font
cask "font-hack-nerd-font"                  # font
cask "font-iosevka-nerd-font"               # font
cask "font-sauce-code-pro-nerd-font"        # font
cask "font-victor-mono-nerd-font"           # font
cask "fork"                                 # git GUI
cask "gimp"                                 # image editor
cask "inkscape"                             # vector graphics editor
cask "keyboardcleantool"                    # disable keyboard for cleaning
cask "libreoffice"                          # office tools
cask "linearmouse"                          # mouse movement controls
cask "mactex"                               # LaTeX
cask "musescore"                            # music notation
cask "netnewswire"                          # RSS reader
cask "obsidian"                             # notes
cask "openmtp"                              # Media Transfer Protocol app
cask "qflipper"                             # Flipper Zero GUI
cask "raycast"                              # macOS launcher (spotlight replacement)
cask "vlc"                                  # media player
cask "wezterm@nightly"                      # terminal
cask "whatsapp"                             # messaging
cask "zoom"                                 # video conferencing
