# formulae
brew "bat"                                  # `cat` alternative
brew "node"                                 # nodejs
brew "difftastic"                           # diff analysis and presentation
brew "eza"                                  # `ls` alternative
brew "fzf"                                  # fuzzy-finder
brew "git-delta"                            # git pager
brew "gnupg"                                # Gnu PGP
brew "ripgrep"                              # fuzzy-finder

# zsh
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "romkatv/powerlevel10k/powerlevel10k"

# neovim
brew "bash-language-server"
brew "clang-format"
brew "cpplint"
brew "eslint"
brew "fd"
brew "lua-language-server"
brew "luacheck"
brew "neovim"
brew "prettier"
brew "shellcheck"
brew "shfmt"
brew "stylua"                               # Lua code formatter
