# formulae
brew "bat"                                  # `cat` alternative
brew "coreutils"
brew "difftastic"                           # diff analysis and presentation
brew "eza"                                  # `ls` alternative
brew "fzf"                                  # fuzzy-finder
brew "git"                                  # source control
brew "git-delta"                            # git pager
brew "gnupg"                                # Gnu PGP
brew "koekeishiya/formulae/yabai"           # Tiling window manager
brew "koekeishiya/formulae/skhd"            # Hotkey daemon
brew "nnn"                                  # TUI file manager
brew "node"                                 # nodejs
brew "pinentry-mac"                         # macOS integration for GPG
brew "ripgrep"                              # fuzzy-finder
brew "rsync"                                # file transfer used in backup script
brew "rustup-init"                          # rust
brew "unbound"                              # DNS resolver
brew "tmux"                                 # terminal multiplexer
brew "trash"                                # move to trash cli https://hasseg.org/trash/
brew "zbar"                                 # QR code reader

# zsh
brew "romkatv/powerlevel10k/powerlevel10k"  # powerlevel10k (zsh)
brew "zsh-autosuggestions"                  # zsh-autosuggestions
brew "zsh-syntax-highlighting"              # zsh-syntax-highlighting

# neovim
brew "bash-language-server"
brew "black"
brew "clang-format"
brew "cpplint"
brew "eslint"
brew "flake8"
brew "isort"
brew "lua-language-server"
brew "luacheck"
brew "neovim"
brew "prettier"
brew "pyright"
brew "shellcheck"
brew "shfmt"
brew "stylua"

# casks
cask "caffeine"                             # prevent computer sleep
cask "font-fira-code-nerd-font"             # font
cask "font-fira-mono-nerd-font"             # font
cask "font-victor-mono-nerd-font"           # font
cask "libreoffice"                          # office tools
cask "openvpn-connect"                      # OpenVPN Connect client
cask "raycast"                              # macOS launcher (spotlight replacement)
cask "wezterm"                              # terminal
