brew "bat"                          # `cat` alternative
brew "coreutils"
brew "difftastic"                   # diff analysis and presentation
brew "exa"                          # `ls` alternative
brew "fzf"                          # fuzzy-finder
brew "git"                          # source control
brew "git-delta"                    # git pager
brew "gnupg"                        # Gnu PGP
brew "node"                         # nodejs
brew "pinentry-mac"                 # macOS integration for GPG
brew "ripgrep"                      # fuzzy-finder
brew "rustup-init"                  # rust
brew "trash"                        # move to trash cli https://hasseg.org/trash/
brew "tree"                         # directory display
brew "capstone"                               # sm64
brew "coreutils"                              # sm64
brew "make"                                   # sm64
brew "pkg-config"                             # sm64
brew "tehzz/n64-dev/mips64-elf-binutils"      # sm64

brew "neovim"                       # text editor
brew "bash-language-server"         # neovim lsp
brew "clang-format"                 # neovim lsp
brew "prettier"                     # neovim lsp
brew "pyright"                      # neovim lsp
brew "rust-analyzer"                # neovim lsp
brew "stylua"                       # neovim lsp

cask "alacritty"                    # terminal
cask "alt-tab"                      # Windows-like alt-tab application switcher
cask "bettertouchtool"              # macOS customizer
cask "brave-browser"                # browser
cask "caffeine"                     # prevent computer sleep
cask "firefox"                      # browser
cask "font-victor-mono-nerd-font"   # font
cask "iterm2"                       # terminal
cask "spotify"                      # music player
cask "visual-studio-code"           # text editor / IDE
cask "zoom"                         # video conferencing
