brew "bat"                          # `cat` alternative
brew "coreutils"
brew "difftastic"                   # diff analysis and presentation
brew "fd"                           # `find` alternative
brew "fzf"                          # fuzzy-finder
brew "git"                          # source control
brew "git-delta"                    # git pager
brew "gnupg"                        # Gnu PGP
brew "lazygit"                      # git TUI
brew "lolcat"
brew "node"                         # nodejs
brew "nushell"                      # shell
brew "pinentry-mac"                 # macOS integration for GPG
brew "ripgrep"                      # fuzzy-finder
brew "rustup-init"                  # rust
brew "task"                         # taskwarrior
brew "terminal-notifier"            # macOS notifications from terminal
brew "tmux"                         # terminal multiplexer
brew "tree"                         # directory display

brew "neovim"                       # text editor
brew "bash-language-server"         # neovim lsp
brew "clang-format"                 # neovim lsp
brew "prettier"                     # neovim lsp
brew "pyright"                      # neovim lsp
brew "rust-analyzer"                # neovim lsp
brew "stylua"                       # neovim lsp

cask "alacritty"                    # terminal
cask "alt-tab"                      # Windows-like alt-tab application switcher
cask "bettertouchtool"              # macOS customizer
cask "brave-browser"                # browser
cask "caffeine"                     # prevent computer sleep
cask "firefox"                      # browser
cask "font-victor-mono-nerd-font"   # font
cask "iterm2"                       # terminal
cask "spotify"                      # music player
cask "visual-studio-code"           # text editor / IDE
cask "zoom"                         # video conferencing
