brew "bat"                                  # `cat` alternative
brew "node"                                 # nodejs
brew "difftastic"
brew "eza"
brew "fzf"
brew "git-delta"
brew "gnupg"
brew "lazygit"
brew "ripgrep"
brew "shfmt"

brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
tap "romkatv/powerlevel10k"
brew "romkatv/powerlevel10k/powerlevel10k"

brew "neovim"
brew "bash-language-server"
brew "clang-format"
brew "fd"
brew "pgformatter"
brew "prettier"
brew "pyright"
brew "rust-analyzer"
brew "stylua"
brew "taplo"
