# formulae
brew "bat"                                  # `cat` alternative
brew "coreutils"                            # Gnu file, shell, and text utilities (gdircolors)
brew "devcontainer"                         # CLI for Development Containers (https://containers.dev)
brew "difftastic"                           # diff analysis and presentation
brew "duf"                                  # disk usage/free utility; 'df' alternative
brew "eza"                                  # `ls` alternative
brew "fastfetch"                            # system information
brew "fzf"                                  # fuzzy-finder
brew "git"                                  # version control
brew "git-lfs"                              # git large file storage
brew "git-delta"                            # git pager
brew "gnupg"                                # Gnu PGP
brew "imagemagick"                          # image manipulation (yazi dep)
brew "lazygit"                              # git TUI
brew "lolcat"                               # rainbow text
brew "luarocks"                             # lua package manager
brew "neovim"                               # text editor
brew "node"                                 # nodejs
brew "poppler"                              # PDF tools (yazi dep)
brew "pyenv"                                # python version manager
brew "ripgrep"                              # fuzzy-finder
brew "sevenzip"                             # 7zip (yazi dep)
brew "slides"                               # presentation tool
brew "starship"                             # shell prompt
brew "thefuck"                              # last console command correction
brew "trash-cli"
brew "tmux"                                 # terminal multiplexer
brew "typtea"                               # typing speed tester
brew "yazi"                                 # terminal file manager
brew "zoxide"                               # `cd` alternative

# zsh
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
