# formulae
brew "bat"                                  # `cat` alternative
brew "cloc"                                 # code line counter
brew "coreutils"                            # GNU core utilities
brew "difftastic"                           # diff analysis and presentation
brew "eza"                                  # `ls` alternative
brew "fastfetch"                            # system information
brew "fzf"                                  # fuzzy-finder
brew "git"                                  # source control
brew "git-lfs"                              # git large file storage
brew "git-delta"                            # git pager
brew "gnupg"                                # Gnu PGP
brew "glslviewer"                           # GLSL viewer
brew "imagemagick"                          # image manipulation (yazi dep)
brew "lazygit"                              # git TUI
brew "lolcat"                               # rainbow text
brew "luarocks"                             # lua package manager
brew "mactex"                               # LaTeX
brew "neovim"                               # text editor
brew "nnn"                                  # TUI file manager
brew "node"                                 # nodejs
brew "pandoc"                               # document converter
brew "pinentry-mac"                         # macOS integration for GPG
brew "poppler"                              # PDF tools (yazi dep)
brew "pyenv"                                # python version manager
brew "ripgrep"                              # fuzzy-finder
brew "rsync"                                # file transfer used in backup script
brew "rustup"                               # rust
brew "sevenzip"                             # 7zip (yazi dep)
brew "slides"                               # presentation tool
brew "starship"                             # shell prompt
brew "task"                                 # task manager
brew "tasksh"                               # shell for task manager
brew "tmux"                                 # terminal multiplexer
brew "trash"                                # move to trash cli https://hasseg.org/trash/
brew "typioca"                              # typing speed tester
brew "unbound"                              # DNS resolver
brew "yazi"                                 # terminal file manager
brew "zbar"                                 # QR code reader
brew "zola"                                 # static site generator
brew "zoxide"                               # `cd` alternative

# zsh
brew "zsh-autosuggestions"                  # zsh-autosuggestions
brew "zsh-syntax-highlighting"              # zsh-syntax-highlighting

# casks
cask "caffeine"                             # prevent computer sleep
cask "dbeaver-community"                    # database manager
cask "font-fira-code-nerd-font"             # font
cask "font-hack-nerd-font"                  # font
cask "font-iosevka-nerd-font"               # font
cask "font-fira-mono-nerd-font"             # font
cask "font-victor-mono-nerd-font"           # font
cask "gimp"                                 # image editor
cask "halloy"                               # IRC client
cask "inkscape"                             # vector graphics editor
cask "libreoffice"                          # office tools
cask "netnewswire"                          # RSS reader
cask "musescore"                            # music notation
cask "obsidian"                             # notes
cask "raycast"                              # macOS launcher (spotlight replacement)
cask "wezterm"                              # terminal
